In [1]:
%load_ext sql
%sql postgresql://postgres:root@localhost/SoleMateAI

# ADMIN DASHBOARD

## CHARTS
### Statistic revenue, profit, capital by hour of a specific day

In [2]:
%sql \
WITH HourReference AS ( \
    SELECT 0 AS hour_of_day \
    UNION SELECT 1 UNION SELECT 2 UNION SELECT 3 \
    UNION SELECT 4 UNION SELECT 5 UNION SELECT 6 \
    UNION SELECT 7 UNION SELECT 8 UNION SELECT 9 \
    UNION SELECT 10 UNION SELECT 11 UNION SELECT 12 \
    UNION SELECT 13 UNION SELECT 14 UNION SELECT 15 \
    UNION SELECT 16 UNION SELECT 17 UNION SELECT 18 \
    UNION SELECT 19 UNION SELECT 20 UNION SELECT 21 \
    UNION SELECT 22 UNION SELECT 23 \
) \
SELECT \
    hr.hour_of_day AS time_point, \
    COALESCE(SUM(revenue_subquery.total_discounted_price), 0) AS revenue_cost, \
    COALESCE(SUM(profit_subquery.total_profit), 0) AS profit_cost, \
    COALESCE(SUM(warehouse_subquery.total_warehouse_price), 0) AS warehouse_cost \
FROM \
    HourReference hr \
LEFT JOIN ( \
    SELECT \
        EXTRACT(HOUR FROM o1.order_date) AS hour_of_day, \
        SUM(o1.total_discounted_price) AS total_discounted_price \
    FROM \
        orders o1 \
    WHERE \
        TO_CHAR(o1.order_date, 'DD/MM/YYYY') = '01/05/2024' \
        AND o1.status = 'ORDER-DELIVERED' \
    GROUP BY \
        EXTRACT(HOUR FROM o1.order_date) \
) revenue_subquery ON hr.hour_of_day = revenue_subquery.hour_of_day \
LEFT JOIN ( \
    SELECT \
        EXTRACT(HOUR FROM o2.order_date) AS hour_of_day, \
        SUM(o2.total_discounted_price - o2.total_warehouse_price) AS total_profit \
    FROM \
        orders o2 \
    WHERE \
        TO_CHAR(o2.order_date, 'DD/MM/YYYY') = '01/05/2024' \
        AND o2.status = 'ORDER-DELIVERED' \
    GROUP BY \
        EXTRACT(HOUR FROM o2.order_date) \
) profit_subquery ON hr.hour_of_day = profit_subquery.hour_of_day \
LEFT JOIN ( \
    SELECT \
        EXTRACT(HOUR FROM o3.order_date) AS hour_of_day, \
        SUM(o3.total_warehouse_price) AS total_warehouse_price \
    FROM \
        orders o3 \
    WHERE \
        TO_CHAR(o3.order_date, 'DD/MM/YYYY') = '01/05/2024' \
        AND o3.status = 'ORDER-DELIVERED' \
    GROUP BY \
        EXTRACT(HOUR FROM o3.order_date) \
) warehouse_subquery ON hr.hour_of_day = warehouse_subquery.hour_of_day \
GROUP BY \
    hr.hour_of_day \
ORDER BY \
    hr.hour_of_day;

 * postgresql://postgres:***@localhost/SoleMateAI
24 rows affected.

[(0, 0.0, 0.0, 0.0),
 (1, 0.0, 0.0, 0.0),
 (2, 0.0, 0.0, 0.0),
 (3, 0.0, 0.0, 0.0),
 (4, 0.0, 0.0, 0.0),
 (5, 0.0, 0.0, 0.0),
 (6, 0.0, 0.0, 0.0),
 (7, 0.0, 0.0, 0.0),
 (8, 0.0, 0.0, 0.0),
 (9, 0.0, 0.0, 0.0),
 (10, 0.0, 0.0, 0.0),
 (11, 22157000.0, 1180000.0, 20977000.0),
 (12, 17691000.0, 8544000.0, 9147000.0),
 (13, 37568000.0, 11354000.0, 26214000.0),
 (14, 0.0, 0.0, 0.0),
 (15, 0.0, 0.0, 0.0),
 (16, 0.0, 0.0, 0.0),
 (17, 0.0, 0.0, 0.0),
 (18, 0.0, 0.0, 0.0),
 (19, 0.0, 0.0, 0.0),
 (20, 0.0, 0.0, 0.0),
 (21, 0.0, 0.0, 0.0),
 (22, 0.0, 0.0, 0.0),
 (23, 0.0, 0.0, 0.0)]

### Statistic revenue, profit, capital by day of a specific month

In [3]:
%sql \
WITH RECURSIVE DayReference AS ( \
    SELECT 1 AS day_of_month \
    UNION ALL \
    SELECT day_of_month + 1 \
    FROM DayReference \
    WHERE day_of_month < EXTRACT(DAY FROM DATE_TRUNC('month', TO_DATE('05/2024', 'MM/YYYY')) + INTERVAL '1 month' - INTERVAL '1 day') \
) \
SELECT \
    dr.day_of_month AS time_point, \
    COALESCE(SUM(revenue_subquery.total_revenue), 0) AS revenue_cost, \
    COALESCE(SUM(profit_subquery.total_profit), 0) AS profit_cost, \
    COALESCE(SUM(warehouse_subquery.total_warehouse_price), 0) AS warehouse_cost \
FROM \
    DayReference dr \
LEFT JOIN ( \
    SELECT \
        EXTRACT(DAY FROM o1.order_date) AS day_of_month, \
        SUM(o1.total_discounted_price) AS total_revenue \
    FROM \
        orders o1 \
    WHERE \
        TO_CHAR(o1.order_date, 'MM/YYYY') = '05/2024' \
        AND o1.status = 'ORDER-DELIVERED' \
    GROUP BY \
        EXTRACT(DAY FROM o1.order_date) \
) revenue_subquery ON dr.day_of_month = revenue_subquery.day_of_month \
LEFT JOIN ( \
    SELECT \
        EXTRACT(DAY FROM o2.order_date) AS day_of_month, \
        SUM(o2.total_discounted_price - o2.total_warehouse_price) AS total_profit \
    FROM \
        orders o2 \
    WHERE \
        TO_CHAR(o2.order_date, 'MM/YYYY') = '05/2024' \
        AND o2.status = 'ORDER-DELIVERED' \
    GROUP BY \
        EXTRACT(DAY FROM o2.order_date) \
) profit_subquery ON dr.day_of_month = profit_subquery.day_of_month \
LEFT JOIN ( \
    SELECT \
        EXTRACT(DAY FROM o3.order_date) AS day_of_month, \
        SUM(o3.total_warehouse_price) AS total_warehouse_price \
    FROM \
        orders o3 \
    WHERE \
        TO_CHAR(o3.order_date, 'MM/YYYY') = '05/2024' \
        AND o3.status = 'ORDER-DELIVERED' \
    GROUP BY \
        EXTRACT(DAY FROM o3.order_date) \
) warehouse_subquery ON dr.day_of_month = warehouse_subquery.day_of_month \
GROUP BY \
    dr.day_of_month \
ORDER BY \
    dr.day_of_month;

 * postgresql://postgres:***@localhost/SoleMateAI
31 rows affected.

[(1, 77416000.0, 21078000.0, 56338000.0),
 (2, 48155000.0, 13576000.0, 34579000.0),
 (3, 27151000.0, 11826000.0, 15325000.0),
 (4, 0.0, 0.0, 0.0),
 (5, 0.0, 0.0, 0.0),
 (6, 0.0, 0.0, 0.0),
 (7, 0.0, 0.0, 0.0),
 (8, 40564000.0, 24972000.0, 15592000.0),
 (9, 0.0, 0.0, 0.0),
 (10, 25516000.0, 1792000.0, 23724000.0),
 (11, 0.0, 0.0, 0.0),
 (12, 25104000.0, 15974000.0, 9130000.0),
 (13, 34953000.0, 10447000.0, 24506000.0),
 (14, 0.0, 0.0, 0.0),
 (15, 52066000.0, 11665000.0, 40401000.0),
 (16, 0.0, 0.0, 0.0),
 (17, 0.0, 0.0, 0.0),
 (18, 36992000.0, 21963000.0, 15029000.0),
 (19, 0.0, 0.0, 0.0),
 (20, 0.0, 0.0, 0.0),
 (21, 0.0, 0.0, 0.0),
 (22, 9955000.0, 34000.0, 9921000.0),
 (23, 36072000.0, 14611000.0, 21461000.0),
 (24, 0.0, 0.0, 0.0),
 (25, 0.0, 0.0, 0.0),
 (26, 10060000.0, 691000.0, 9369000.0),
 (27, 0.0, 0.0, 0.0),
 (28, 0.0, 0.0, 0.0),
 (29, 22433000.0, 12381000.0, 10052000.0),
 (30, 26182000.0, 10789000.0, 15393000.0),
 (31, 58525000.0, 31764000.0, 26761000.0)]

### Statistic revenue, profit, capital by month of a specific year

In [4]:
%sql \
WITH MonthReference AS ( \
    SELECT 1 AS month_of_year \
    UNION ALL \
    SELECT 2 UNION SELECT 3 UNION SELECT 4 \
    UNION SELECT 5 UNION SELECT 6 UNION SELECT 7 \
    UNION SELECT 8 UNION SELECT 9 UNION SELECT 10 \
    UNION SELECT 11 UNION SELECT 12 \
) \
SELECT \
    mr.month_of_year AS time_point, \
    COALESCE(SUM(revenue_subquery.total_revenue), 0) AS revenue_cost, \
    COALESCE(SUM(profit_subquery.total_profit), 0) AS profit_cost, \
    COALESCE(SUM(warehouse_subquery.total_warehouse_price), 0) AS warehouse_cost \
FROM \
    MonthReference mr \
LEFT JOIN ( \
    SELECT \
        EXTRACT(MONTH FROM o1.order_date) AS month_of_year, \
        SUM(o1.total_discounted_price) AS total_revenue \
    FROM \
        orders o1 \
    WHERE \
        TO_CHAR(o1.order_date, 'YYYY') = '2024' \
        AND o1.status = 'ORDER-DELIVERED' \
    GROUP BY \
        EXTRACT(MONTH FROM o1.order_date) \
) revenue_subquery ON mr.month_of_year = revenue_subquery.month_of_year \
LEFT JOIN ( \
    SELECT \
        EXTRACT(MONTH FROM o2.order_date) AS month_of_year, \
        SUM(o2.total_discounted_price - o2.total_warehouse_price) AS total_profit \
    FROM \
        orders o2 \
    WHERE \
        TO_CHAR(o2.order_date, 'YYYY') = '2024' \
        AND o2.status = 'ORDER-DELIVERED' \
    GROUP BY \
        EXTRACT(MONTH FROM o2.order_date) \
) profit_subquery ON mr.month_of_year = profit_subquery.month_of_year \
LEFT JOIN ( \
    SELECT \
        EXTRACT(MONTH FROM o3.order_date) AS month_of_year, \
        SUM(o3.total_warehouse_price) AS total_warehouse_price \
    FROM \
        orders o3 \
    WHERE \
        TO_CHAR(o3.order_date, 'YYYY') = '2024' \
        AND o3.status = 'ORDER-DELIVERED' \
    GROUP BY \
        EXTRACT(MONTH FROM o3.order_date) \
) warehouse_subquery ON mr.month_of_year = warehouse_subquery.month_of_year \
GROUP BY \
    mr.month_of_year \
ORDER BY \
    mr.month_of_year;

 * postgresql://postgres:***@localhost/SoleMateAI
12 rows affected.

[(1, 0.0, 0.0, 0.0),
 (2, 0.0, 0.0, 0.0),
 (3, 0.0, 0.0, 0.0),
 (4, 72302000.0, 27628000.0, 44674000.0),
 (5, 531144000.0, 203563000.0, 327581000.0),
 (6, 105626000.0, 38733000.0, 66893000.0),
 (7, 0.0, 0.0, 0.0),
 (8, 0.0, 0.0, 0.0),
 (9, 0.0, 0.0, 0.0),
 (10, 0.0, 0.0, 0.0),
 (11, 0.0, 0.0, 0.0),
 (12, 0.0, 0.0, 0.0)]

## STATS
### Total revenue, profit, capital, item sold of a specific day

In [5]:
%sql \
WITH revenue_profit_warehouse AS ( \
    SELECT \
        COALESCE(SUM(revenue_subquery.total_revenue), 0) AS revenue_cost, \
        COALESCE(SUM(profit_subquery.total_profit), 0) AS profit_cost, \
        COALESCE(SUM(warehouse_subquery.total_warehouse_price), 0) AS warehouse_cost \
    FROM \
        ( \
            SELECT \
                SUM(o1.total_discounted_price) AS total_revenue \
            FROM \
                orders o1 \
            WHERE \
                TO_CHAR(o1.order_date, 'DD/MM/YYYY') = '01/05/2024' \
                AND o1.status = 'ORDER-DELIVERED' \
        ) revenue_subquery, \
        ( \
            SELECT \
                SUM(o2.total_discounted_price - o2.total_warehouse_price) AS total_profit \
            FROM \
                orders o2 \
            WHERE \
                TO_CHAR(o2.order_date, 'DD/MM/YYYY') = '01/05/2024' \
                AND o2.status = 'ORDER-DELIVERED' \
        ) profit_subquery, \
        ( \
            SELECT \
                SUM(o3.total_warehouse_price) AS total_warehouse_price \
            FROM \
                orders o3 \
            WHERE \
                TO_CHAR(o3.order_date, 'DD/MM/YYYY') = '01/05/2024' \
                AND o3.status = 'ORDER-DELIVERED' \
        ) warehouse_subquery \
) \
SELECT \
    rp.revenue_cost, \
    rp.profit_cost, \
    rp.warehouse_cost, \
    TO_CHAR(o.order_date, 'DD/MM/YYYY') AS selected_day, \
    SUM(o.total_item) AS total_items_sold \
FROM \
    orders o \
CROSS JOIN \
    revenue_profit_warehouse rp \
WHERE \
    TO_CHAR(o.order_date, 'DD/MM/YYYY') = '01/05/2024' \
    AND o.status = 'ORDER-DELIVERED' \
GROUP BY \
    TO_CHAR(o.order_date, 'DD/MM/YYYY'), \
    rp.revenue_cost, \
    rp.profit_cost, \
    rp.warehouse_cost \
ORDER BY \
    selected_day;

 * postgresql://postgres:***@localhost/SoleMateAI
1 rows affected.

[(77416000.0, 21078000.0, 56338000.0, '01/05/2024', 19)]

In [6]:
%sql SELECT order_date, status, updated_at, is_active, total_item, total_display_price, total_warehouse_price, total_discounted_price FROM orders LIMIT 10;

 * postgresql://postgres:***@localhost/SoleMateAI
10 rows affected.

[(datetime.datetime(2024, 4, 26, 9, 23, 48), 'ORDER-DELIVERED', datetime.datetime(2024, 4, 26, 7, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), False, 8, 36550000.0, 16920000.0, 25558000.0),
 (datetime.datetime(2024, 4, 28, 18, 42, 50), 'ORDER-DELIVERED', datetime.datetime(2024, 4, 28, 7, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), False, 9, 44191000.0, 10912000.0, 10966000.0),
 (datetime.datetime(2024, 4, 28, 16, 24, 20), 'ORDER-DELIVERED', datetime.datetime(2024, 4, 28, 7, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), False, 7, 26784000.0, 8468000.0, 19034000.0),
 (datetime.datetime(2024, 4, 29, 9, 20, 18), 'ORDER-DELIVERED', datetime.datetime(2024, 4, 29, 7, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), False, 2, 22973000.0, 8374000.0, 16744000.0),
 (datetime.datetime(2024, 5, 1, 13, 46, 39), 'ORDER-DELIVERED', datetime.datetime(2024, 5, 1, 7, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), False, 6, 47058000.0, 26214000.0, 37568000.0),
 (datetime.datetime(2024, 5, 1, 12, 15, 18), 'ORDER-DELIVERED', datetime.datetime(2024, 5, 1, 7, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), False, 6, 42998000.0, 9147000.0, 17691000.0),
 (datetime.datetime(2024, 5, 1, 11, 41, 40), 'ORDER-DELIVERED', datetime.datetime(2024, 5, 1, 7, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), False, 7, 39184000.0, 20977000.0, 22157000.0),
 (datetime.datetime(2024, 5, 2, 10, 40, 43), 'ORDER-DELIVERED', datetime.datetime(2024, 5, 2, 7, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), False, 7, 38983000.0, 20276000.0, 23167000.0),
 (datetime.datetime(2024, 5, 2, 13, 0, 43), 'ORDER-DELIVERED', datetime.datetime(2024, 5, 2, 7, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), False, 3, 45759000.0, 14303000.0, 24988000.0),
 (datetime.datetime(2024, 5, 3, 12, 55, 45), 'ORDER-DELIVERED', datetime.datetime(2024, 5, 3, 7, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), False, 5, 28696000.0, 15325000.0, 27151000.0)]

In [7]:
%sql SELECT user_id, rating, comment, heart_count FROM reviews LIMIT 10;

 * postgresql://postgres:***@localhost/SoleMateAI
10 rows affected.

[(UUID('7f3537d0-dc1d-447d-b26d-cfda815a6b1f'), 5, 'Giày đẹp lắm, chất lượng tuyệt vời.', 342),
 (UUID('7f3537d0-dc1d-447d-b26d-cfda815a6b1f'), 3, 'Giày tạm được nha shop.', 361),
 (UUID('7f3537d0-dc1d-447d-b26d-cfda815a6b1f'), 4, 'Giày đẹp chất lượng ổn.', 422),
 (UUID('7f3537d0-dc1d-447d-b26d-cfda815a6b1f'), 4, 'Giày đẹp chất lượng ổn.', 163),
 (UUID('7f3537d0-dc1d-447d-b26d-cfda815a6b1f'), 3, 'Giày tạm được nha shop.', 141),
 (UUID('7f3537d0-dc1d-447d-b26d-cfda815a6b1f'), 3, 'Giày tạm được nha shop.', 241),
 (UUID('7f3537d0-dc1d-447d-b26d-cfda815a6b1f'), 4, 'Giày đẹp chất lượng ổn.', 275),
 (UUID('7f3537d0-dc1d-447d-b26d-cfda815a6b1f'), 5, 'Giày đẹp lắm, chất lượng tuyệt vời.', 332),
 (UUID('7f3537d0-dc1d-447d-b26d-cfda815a6b1f'), 4, 'Giày đẹp chất lượng ổn.', 481),
 (UUID('7f3537d0-dc1d-447d-b26d-cfda815a6b1f'), 4, 'Giày đẹp chất lượng ổn.', 366)]

#### knowledge base of chatbot

In [8]:
%sql WITH ranked_shoes AS ( \
    SELECT \
        sho.id AS shoe_id, \
        sho.shoe_name, \
        b.brand_name, \
        s.size_number, \
        c.color_name, \
        sho.discounted_price, \
        sp.promotion_id, \
        ROW_NUMBER() OVER (PARTITION BY sho.brand_id ORDER BY sho.id) AS rn \
    FROM \
        shoes AS sho \
    JOIN \
        brands AS b ON sho.brand_id = b.id \
    JOIN \
        sizes AS s ON sho.size_id = s.id \
    JOIN \
        colors AS c ON sho.color_id = c.id \
    LEFT JOIN \
        shoes_promotions AS sp ON sho.id = sp.shoe_id \
    WHERE \
        sho.deleted_at IS NULL \
        AND b.deleted_at IS NULL \
        AND s.deleted_at IS NULL \
        AND c.deleted_at IS NULL \
        AND sp.promotion_id IS NOT NULL \
) \
SELECT \
    rs.shoe_id, \
    rs.shoe_name, \
    rs.brand_name, \
    rs.size_number, \
    rs.color_name, \
    rs.discounted_price, \
    p.promotion_name, \
    p.start_date AS promotion_start_date, \
    p.end_date AS promotion_end_date, \
    p.discount_percent AS promotion_discount_percent \
FROM \
    ranked_shoes AS rs \
LEFT JOIN \
    promotions AS p ON rs.promotion_id = p.id AND p.deleted_at IS NULL \
WHERE \
    rs.rn <= 2;

 * postgresql://postgres:***@localhost/SoleMateAI
8 rows affected.

[(UUID('0a365ea4-b3f2-4273-939c-ac4fca2f5dbc'), 'Puma Shoe Model Black 40', 'Puma', 40, 'Black', 990000.0, 'Quay Trở Lại Trường Học', datetime.datetime(2024, 9, 1, 7, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), datetime.datetime(2024, 9, 30, 7, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), 10),
 (UUID('0a365ea4-b3f2-4273-939c-ac4fca2f5dbc'), 'Puma Shoe Model Black 40', 'Puma', 40, 'Black', 990000.0, 'Quay Trở Lại Trường Học', datetime.datetime(2024, 9, 1, 7, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), datetime.datetime(2024, 9, 30, 7, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), 10),
 (UUID('2625c217-641f-4da1-b58d-7632ed8c6ec4'), 'Adidas Shoe Model Yellow 42', 'Adidas', 42, 'Yellow', 800000.0, 'Mùa Hè Sale cùng Sole Mate AI', datetime.datetime(2024, 6, 1, 7, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), datetime.datetime(2024, 8, 31, 7, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), 20),
 (UUID('5a0c8579-0a6b-45ef-acf0-15f825cae780'), 'Adidas Shoe Model Yellow 40', 'Adidas', 40, 'Yellow', 1280000.0, 'Mùa Hè Sale cùng Sole Mate AI', datetime.datetime(2024, 6, 1, 7, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), datetime.datetime(2024, 8, 31, 7, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), 20),
 (UUID('020a6f89-2011-487f-acf2-2165a6d9f239'), 'Reebok Shoe Model Light Blue 41', 'Reebok', 41, 'Light Blue', 1360000.0, 'Quay Trở Lại Trường Học', datetime.datetime(2024, 9, 1, 7, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), datetime.datetime(2024, 9, 30, 7, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), 10),
 (UUID('020a6f89-2011-487f-acf2-2165a6d9f239'), 'Reebok Shoe Model Light Blue 41', 'Reebok', 41, 'Light Blue', 1360000.0, 'Test KM', datetime.datetime(2024, 6, 23, 14, 24, 41, 51000, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), datetime.datetime(2024, 6, 29, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), 20),
 (UUID('1467eaf2-2030-49e3-a349-a8fa75e307ff'), 'Nike Shoe Model Orange 42', 'Nike', 42, 'Orange', 1280000.0, 'Mùa Hè Sale cùng Sole Mate AI', datetime.datetime(2024, 6, 1, 7, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), datetime.datetime(2024, 8, 31, 7, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), 20),
 (UUID('16df8f55-ad2c-48d3-97a2-b5dce4cbcf5d'), 'Nike Shoe Model Blue 40', 'Nike', 40, 'Blue', 1200000.0, 'Mùa Hè Sale cùng Sole Mate AI', datetime.datetime(2024, 6, 1, 7, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), datetime.datetime(2024, 8, 31, 7, 0, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), 20)]

#### get latest shoe

In [9]:
%sql \
SELECT  \
        sho.id AS shoe_id, \
        sho.shoe_name, \
        b.brand_name, \
        s.size_number, \
        c.color_name, \
        sho.discounted_price, \
        sho.created_at, \
        p.promotion_name, \
        p.start_date AS promotion_start_date, \
        p.end_date AS promotion_end_date, \
        p.discount_percent AS promotion_discount_percent \
    FROM  \
        shoes AS sho \
    JOIN  \
        brands AS b ON sho.brand_id = b.id \
    JOIN  \
        sizes AS s ON sho.size_id = s.id \
    JOIN  \
        colors AS c ON sho.color_id = c.id \
    LEFT JOIN  \
        shoes_promotions AS sp ON sho.id = sp.shoe_id \
    LEFT JOIN  \
        promotions AS p ON sp.promotion_id = p.id \
    WHERE  \
        sho.deleted_at IS NULL  \
        AND b.deleted_at IS NULL  \
        AND s.deleted_at IS NULL  \
        AND c.deleted_at IS NULL  \
    ORDER BY  \
        sho.created_at DESC \
    LIMIT 5;

 * postgresql://postgres:***@localhost/SoleMateAI
5 rows affected.

[(UUID('b147ec53-ee23-4cbf-9b0b-facbe47fc334'), 'Adidas test', 'Reebok', 1, 'Orange', 1.0, datetime.datetime(2024, 6, 23, 14, 34, 5, 286061, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), None, None, None, None),
 (UUID('78e280e5-ac99-42bb-82da-52f0d4a2e6c1'), 'Adidas Shoe Model Grey 41', 'Adidas', 41, 'Grey', 1900000.0, datetime.datetime(2024, 6, 23, 14, 20, 42, 501205, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), None, None, None, None),
 (UUID('8c218ef1-016a-427e-a6ab-b65ac555d090'), 'Adidas Shoe Model Blue 42', 'Adidas', 42, 'Blue', 1100000.0, datetime.datetime(2024, 6, 23, 14, 20, 42, 492697, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), None, None, None, None),
 (UUID('70f3eb1f-e6a1-41ee-82e0-2a07e0a873db'), 'Reebok Shoe Model Orange 42', 'Reebok', 42, 'Orange', 2000000.0, datetime.datetime(2024, 6, 23, 14, 20, 42, 475512, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), None, None, None, None),
 (UUID('0b27cf9f-7c24-4caa-b31e-2d56f99b62dc'), 'Reebok Shoe Model Yellow 40', 'Reebok', 40, 'Yellow', 1900000.0, datetime.datetime(2024, 6, 23, 14, 20, 42, 475512, tzinfo=datetime.timezone(datetime.timedelta(seconds=25200))), None, None, None, None)]